[["lina bought 10 fruits and luna bought 15 fruits from the market.What is the total fruits they bought together?","jon has 4 apples and mira has 5 oranges . what is the total sum of fruits they have?",". Lucy went to the grocery store. She bought 12 packs of cookies and 16 packs of noodles. How many packs of groceries did she buy in all?","Roden went to a pet shop. He bought 15 gold fish and 7 blue fish. How many fish did he buy?","I read 21 pages of my English book yesterday. Today, I read 17 pages.What is the total number of pages did I read?","In a school, there are 542 girls and 387 boys. How many pupils are there in that school?","In a school, there are 542 girls and 387 boys. How many pupils are there in that school?","Linda has 34 candies. Chloe has 28. How many candies do they have in all?","Molly had 14 candles on her birthday cake. She grew older and got 6 more on her birthday cake. How old is Molly now?"
,"snow had 10 watermelons.He ate 5 of them.How many are remaining now?","Cade had 87 marbles. He gave 8 to Dylan. How many does he have left?","Michael has some fish in his fish tank. Ben gave him 18 more fish. Now he has 49.How many fish did he have to begin with?","Hayley had 25 meatballs on her plate. Kirsten stole some of her meatballs. Now she has 11 meatballs on her plate. How many meatballs did Kirsten steal?","Mrs. Sheridan has 11 cats. How many more cats does Mrs. Sheridan need to have 43 cats? ","Mrs. Franklin had 58 Valentines. Mrs. Franklin gave some to her students. Now she has 16. How many Valentines did Mrs. Franklin give to her students?","Mrs. Santiago has 58 red roses. Mrs. Garrett has 24. How many more red roses does Mrs. Santiago have than Mrs. Garrett?"
,"black gets 2 apples a day.how many apples does he have after 7 days?","If he has 4 friends coming over and he made 3 sandwiches for each one of them. how many sandwiches did he make in total?","If he used 2 oranges per glass of juice and he made 6 glasses of juice, how many oranges did he use?","If each game takes 5 minutes to prepare and he prepared a total of 5 games, how many minutes did it take for Andrew to prepare all the games?","If each game takes 5 minutes to prepare and he prepared a total of 5 games, how many minutes did it take for Andrew to prepare all the games?","If he spent 9 for each game they played and they played a total of 5 games, how much money did he spend that night?"
,"jon has 10 balls.He uses 2 balls per game.How many games can he play?","Marian also baked oatmeal cookies for her classmates. If she can place 12 cookies on a tray at a time, how many trays will she need to prepare 276 oatmeal cookies at a time?","Marian’s friends were coming over that afternoon so she made 480 bite-sized pretzels. If one serving is equal to 12 pretzels, how many servings of bite-sized pretzels was Marian able to prepare?","They are to repaint 350 balls in ten different colors. If they painted an equal number of balls for every color, how many balls are there for each color?"
,"She made 47 gingerbread cookies which she will distribute equally in tiny glass jars. If each jar is to contain 6 cookies each, how many cookies will not be placed in a jar?","She also prepared 59 croissants which she plans to give to her 8 neighbors. If each neighbor received and equal number of croissants,how many will be left with Marian?"
],[1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,3,3,3,3,3,3,4,4,4,4,5,5]]